In [3]:
import pandas as pd

In [6]:
df = pd.read_csv("students.csv")

In [9]:

df.head()

   student_id    name  age  gender  marks  attendance
0           1  Saniya   20  Female     85          90
1           2  Ayesha   21  Female     78          88
2           3    Sara   19  Female     92          95
3           4  Fatima   20  Female     65          70
4           5     Ali   22    Male     55          60

In [10]:
df.tail()

   student_id    name  age  gender  marks  attendance
5           6   Ahmed   21    Male     72          80
6           7    Zara   20  Female     88          92
7           8   Imran   23    Male     40          50
8           9    Noor   19  Female     95          98
9          10  Sameer   22    Male     68          75

In [13]:
df.columns

Index(['student_id', 'name', 'age', 'gender', 'marks', 'attendance'], dtype='object')

In [14]:
df.dtypes

student_id     int64
name          object
age            int64
gender        object
marks          int64
attendance     int64
dtype: object

In [15]:
df.shape

(10, 6)

In [16]:
df.describe()

       student_id        age      marks  attendance
count    10.00000  10.000000  10.000000   10.000000
mean      5.50000  20.700000  73.800000   79.800000
std       3.02765   1.337494  17.434321   15.922032
min       1.00000  19.000000  40.000000   50.000000
25%       3.25000  20.000000  65.750000   71.250000
50%       5.50000  20.500000  75.000000   84.000000
75%       7.75000  21.750000  87.250000   91.500000
max      10.00000  23.000000  95.000000   98.000000

In [17]:
df.mean(numeric_only=True)
df.median(numeric_only=True)
df.min()
df.max()
df.count()

student_id    10
name          10
age           10
gender        10
marks         10
attendance    10
dtype: int64

In [21]:
df.info()
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   student_id  10 non-null     int64
 1   name        10 non-null     object
 2   age         10 non-null     int64
 3   gender      10 non-null     object
 4   marks       10 non-null     int64
 5   attendance  10 non-null     int64
dtypes: int64(4), object(2)
memory usage: 612.0+ bytes

student_id    0
name          0
age           0
gender        0
marks         0
attendance    0
dtype: int64

In [ ]:
#“All operations mentioned in Project-2, such as loading CSV/Excel, inspecting data, computing summary statistics, filtering rows, selecting columns, slicing subsets, and saving processed data, were successfully.
#implemented using Pandas.”